#+TITLE: Predicting Probability of Default
#+DESCRIPTION: Данный .org-файл является автособираемым. В emacs сочетание клавиш `Ctrl+c > Ctrl+v > t` конвертирует данный .org-файл в ./src/model.py
#+AUTHOR: Arthur Manzhetov
#+STARTUP: content
#+OPTIONS: line-break:t

*** R2
     #+begin_src python
       from sklearn.metrics import r2_score
       r2_score(y_test, binary_answers)
     #+end_src

     #+RESULTS:
     =0.9838153187177718=
*** Accuracy
    доля верно классифицированных объектов относительно общего количества объектов
     #+begin_src python
       from sklearn.metrics import accuracy_score
       accuracy_score(y_test, binary_answers)
     #+end_src

     #+RESULTS:
     =0.9927770093745197=
